tap "homebrew/bundle"
# Run your GitHub Actions locally
brew "act"
# Cross-platform make
brew "cmake"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Utility for directing compilation
brew "make"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14"
# Implementation of Telnet and SSH
brew "putty"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Open source build of Lens Kubernetes IDE
brew "zsh"
cask "openlens"
vscode "akamud.vscode-theme-onedark"
vscode "alphabotsec.vscode-eclipse-keybindings"
vscode "andenetalexander.vim-cheatsheet"
vscode "angelomollame.conflict-squeezer"
vscode "antfu.icons-carbon"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "edwinkofler.vscode-hyperupcall-pack-product-icons"
vscode "elanandkumar.el-vsc-product-icon-theme"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "georgewfraser.vscode-javac"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "harryhopkinson.vs-code-runner"
vscode "hashicorp.terraform"
vscode "idleberg.applescript"
vscode "it-is-michal.vscode-stashek"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "k--kato.intellij-idea-keybindings"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "maxkless.git-squash-all"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "melishev.feather-vscode"
vscode "mhutchie.git-graph"
vscode "michaelcurrin.auto-commit-msg"
vscode "microprofile-community.mp-rest-client-generator-vscode-ext"
vscode "microprofile-community.mp-starter-vscode-ext"
vscode "microprofile-community.vscode-microprofile-pack"
vscode "miguelsolorio.fluent-icons"
vscode "moalamri.inline-fold"
vscode "mquandalle.graphql"
vscode "mrmlnc.vscode-pugbeautify"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-fr"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.onedrive-browser"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msfukui.eof-mark"
vscode "obrejla.netbeans-light-theme"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-community-server-connector"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-yaml"
vscode "riccardonovaglia.missinglineendoffile"
vscode "rvest.vs-code-prettier-eslint"
vscode "sainnhe.everforest"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "starkwang.markdown"
vscode "stkb.rewrap"
vscode "svelte.svelte-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-concourse"
vscode "vmware.vscode-manifest-yaml"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wscats.eno"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "znck.grammarly"
